In [45]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import plotly.express as px

In [46]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [47]:
df = sns.load_dataset("tips")

In [48]:
df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [49]:
df.shape

(244, 7)

In [50]:
df[df.duplicated()]

     total_bill  tip     sex smoker   day   time  size
202        13.0  2.0  Female    Yes  Thur  Lunch     2

In [51]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [37]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [53]:
df = pd.get_dummies(df, columns=["sex", "smoker", "day", "time"], drop_first=True)

In [54]:
df.head(5)

,total_bill,tip,size,sex_Female,smoker_No,day_Fri,day_Sat,day_Sun,time_Dinner
0,16.99,1.01,2,True,True,False,False,True,True
1,10.34,1.66,3,False,True,False,False,True,True
2,21.01,3.50,3,False,True,False,False,True,True
3,23.68,3.31,2,False,True,False,False,True,True
4,24.59,3.61,4,True,True,False,False,True,True

In [59]:
from sklearn.model_selection import train_test_split

x=df.drop(columns="tip" , axis=1)
y=df["tip"]

In [60]:
df.head(5)

,total_bill,tip,size,sex_Female,smoker_No,day_Fri,day_Sat,day_Sun,time_Dinner
0,16.99,1.01,2,True,True,False,False,True,True
1,10.34,1.66,3,False,True,False,False,True,True
2,21.01,3.50,3,False,True,False,False,True,True
3,23.68,3.31,2,False,True,False,False,True,True
4,24.59,3.61,4,True,True,False,False,True,True

In [63]:
y=["tip"]

In [71]:
df.shape

(244, 9)

In [6]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score, mean_squared_error
import pandas as pd
import numpy as np

# Assuming you have a dataset with features (x) and labels (y)
# Replace x and y with your actual data

# Generate some example data
x = np.random.rand(100, 5)  # 100 samples, 5 features each
y = np.random.rand(100)  # Regression target variable

# Split the data into training and testing sets
test_size = 0.1  # 90% for training, 10% for testing
random_state = 0  # Set a random seed for reproducibility
x_train_train, X_test, y_train, y_test = train_test_split(x, y, test_size=test_size, random_state=random_state)

# Standardize the features using StandardScaler
ss = StandardScaler()
scaled_xtrain = ss.fit_transform(x_train_train)
scaled_xtest = ss.transform(X_test)

# Create DataFrames from the scaled arrays
x_train_scaled = pd.DataFrame(scaled_xtrain, columns=pd.RangeIndex(start=0, stop=x_train_train.shape[1], step=1))
x_test_scaled = pd.DataFrame(scaled_xtest, columns=pd.RangeIndex(start=0, stop=X_test.shape[1], step=1))

# Display the scaled training set
print(x_train_scaled.head())

# Train a linear regression model
lr = LinearRegression()
lr.fit(x_train_scaled, y_train)

# Make predictions on the scaled test set
y_pred = lr.predict(x_test_scaled)

# Evaluate the model
r2 = r2_score(y_test, y_pred)
rmse = np.sqrt(mean_squared_error(y_test, y_pred))

print(f"R^2 Score: {r2}")
print(f"Root Mean Squared Error: {rmse}")

          0         1         2         3         4
0  0.903127 -0.253143 -0.266367  1.228404  1.178578
1  1.388923  0.579783 -1.135036  1.447605 -0.127579
2 -0.907561  0.679444 -1.272835  0.563440  0.653950
3 -1.182220 -0.475612 -1.527952 -1.241002  0.812447
4 -0.479880  0.810681  0.548229  1.016603  0.878512
R^2 Score: -0.39408728648002644
Root Mean Squared Error: 0.2908241596899776

In [13]:
import duckdb
conn=duckdb.connect()
conn.register("df",df)

ModuleNotFoundError: No module named 'duckdb'